--- src/crypto/key_management.rs
+++ replace != with == in KeyDerivation::derive_key
@@ -99,17 +99,17 @@
             .hash_password(password.as_bytes(), &salt_string)
             .map_err(|e| BackupError::EncryptionError(format!("パスワードハッシュエラー: {e}")))?;
 
         let hash = password_hash
             .hash
             .ok_or_else(|| BackupError::EncryptionError("ハッシュ生成に失敗".to_string()))?;
         let hash_bytes = hash.as_bytes();
 
-        if hash_bytes.len() != 32 {
+        if hash_bytes.len() == /* ~ changed by cargo-mutants ~ */ 32 {
             return Err(BackupError::EncryptionError("無効なキー長".to_string()));
         }
 
         let mut key = [0u8; 32];
         key.copy_from_slice(hash_bytes);
         Ok(MasterKey::from_bytes(key))
     }
 
