--- src/core/backup.rs
+++ replace BackupRunner::with_compression -> Self with Default::default()
@@ -182,19 +182,17 @@
         self.enable_encryption = true;
         self.password = Some(password);
         self
     }
 
     /// 圧縮設定
     #[must_use]
     pub fn with_compression(mut self, compression_type: CompressionType, level: i32) -> Self {
-        self.compression_type = compression_type;
-        self.compression_level = level;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 整合性検証の有効/無効を設定
     #[must_use]
     pub fn with_verification(mut self, verify: bool) -> Self {
         self.verify_integrity = verify;
         self
     }
