--- src/crypto/key_management.rs
+++ replace KeyDerivation::generate_salt -> [u8; 16] with [0; 16]
@@ -111,19 +111,17 @@
         let mut key = [0u8; 32];
         key.copy_from_slice(hash_bytes);
         Ok(MasterKey::from_bytes(key))
     }
 
     /// ランダムなソルトを生成
     #[must_use]
     pub fn generate_salt() -> [u8; 16] {
-        let mut salt = [0u8; 16];
-        OsRng.fill_bytes(&mut salt);
-        salt
+        [0; 16] /* ~ changed by cargo-mutants ~ */
     }
 
     /// パスワードを検証
     ///
     /// # Errors
     ///
     /// 以下の場合にエラーを返します:
     /// - ハッシュ文字列のパースに失敗した場合 (`BackupError::EncryptionError`)
