--- src/core/backup.rs
+++ replace BackupRunner::with_verification -> Self with Default::default()
@@ -190,18 +190,17 @@
         self.compression_type = compression_type;
         self.compression_level = level;
         self
     }
 
     /// 整合性検証の有効/無効を設定
     #[must_use]
     pub fn with_verification(mut self, verify: bool) -> Self {
-        self.verify_integrity = verify;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 増分バックアップを有効化
     #[must_use]
     pub fn with_incremental(mut self, incremental: bool) -> Self {
         self.incremental = incremental;
         self
     }
