--- src/core/backup.rs
+++ replace BackupRunner::with_incremental -> Self with Default::default()
@@ -197,18 +197,17 @@
     pub fn with_verification(mut self, verify: bool) -> Self {
         self.verify_integrity = verify;
         self
     }
 
     /// 増分バックアップを有効化
     #[must_use]
     pub fn with_incremental(mut self, incremental: bool) -> Self {
-        self.incremental = incremental;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// バックアップを実行
     ///
     /// 設定に基づいて並列バックアップを実行します。
     /// 優先度フィルタを指定することで、特定の優先度のファイルのみをバックアップできます。
     ///
     /// # 引数
