--- src/crypto/key_management.rs
+++ replace KeyDerivation::verify_password -> Result<bool> with Ok(true)
@@ -125,23 +125,17 @@
     ///
     /// # Errors
     ///
     /// 以下の場合にエラーを返します:
     /// - ハッシュ文字列のパースに失敗した場合 (`BackupError::EncryptionError`)
     ///   - 無効なPHC文字列形式の場合
     ///   - 破損したハッシュデータの場合
     pub fn verify_password(&self, password: &str, hash: &str) -> Result<bool> {
-        let parsed_hash = PasswordHash::new(hash)
-            .map_err(|e| BackupError::EncryptionError(format!("ハッシュ解析エラー: {e}")))?;
-
-        let argon2 = Argon2::default();
-        Ok(argon2
-            .verify_password(password.as_bytes(), &parsed_hash)
-            .is_ok())
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for KeyDerivation {
     fn default() -> Self {
         Self::new(KeyDerivationConfig::default())
     }
 }
