--- src/core/backup.rs
+++ replace == with != in BackupRunner::run
@@ -264,17 +264,17 @@
         let mut targets: Vec<&Target> = if let Some(priority) = priority_filter {
             self.config.filter_by_priority(priority)
         } else {
             self.config.targets.iter().collect()
         };
 
         // カテゴリフィルタの適用
         if let Some(category) = category_filter {
-            targets.retain(|t| t.category == category);
+            targets.retain(|t| t.category != /* ~ changed by cargo-mutants ~ */ category);
         }
 
         if targets.is_empty() {
             return Ok(BackupResult::new());
         }
 
         // バックアップ先ディレクトリの準備（バックアップ名/カテゴリ階層構造）
         let dest_base = &self.config.backup.destination;
