--- src/core/backup.rs
+++ replace && with || in BackupRunner::run
@@ -280,17 +280,17 @@
         let dest_base = &self.config.backup.destination;
         let now = chrono::Local::now();
         let timestamp = now.format("%Y%m%d_%H%M%S");
         let backup_name = format!("backup_{timestamp}");
         let backup_base = dest_base.join(&backup_name);
 
         // 暗号化が有効な場合、KeyManagerとmaster keyを準備
         let (_key_manager, master_key, encryption_salt) =
-            if self.enable_encryption && self.password.is_some() {
+            if self.enable_encryption || /* ~ changed by cargo-mutants ~ */ self.password.is_some() {
                 let km = KeyManager::default();
                 let password = self.password.as_ref().ok_or_else(|| {
                     anyhow::anyhow!("暗号化が有効ですがパスワードが設定されていません")
                 })?;
                 let (mk, salt) = km
                     .create_master_key(password)
                     .context("マスターキー生成失敗")?;
                 (Some(km), Some(Arc::new(mk)), Some(salt))
