--- src/crypto/key_management.rs
+++ replace KeyManager::create_master_key -> Result<(MasterKey, [u8; 16])> with Ok((Default::default(), [1; 16]))
@@ -166,19 +166,17 @@
     /// # Errors
     ///
     /// 以下の場合にエラーを返します:
     /// - `derive_key` 関数内で発生するエラー（詳細は `KeyDerivation::derive_key` を参照）
     ///   - Argon2パラメータエラー
     ///   - パスワードハッシュ生成エラー
     ///   - 無効なキー長エラー
     pub fn create_master_key(&self, password: &str) -> Result<(MasterKey, [u8; 16])> {
-        let salt = KeyDerivation::generate_salt();
-        let key = self.derivation.derive_key(password, &salt)?;
-        Ok((key, salt))
+        Ok((Default::default(), [1; 16])) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 既存のソルトでマスターキーを復元
     ///
     /// # Errors
     ///
     /// 以下の場合にエラーを返します:
     /// - `derive_key` 関数内で発生するエラー（詳細は `KeyDerivation::derive_key` を参照）
