--- src/crypto/key_management.rs
+++ replace KeyManager::restore_master_key -> Result<MasterKey> with Ok(Default::default())
@@ -181,17 +181,17 @@
     /// # Errors
     ///
     /// 以下の場合にエラーを返します:
     /// - `derive_key` 関数内で発生するエラー（詳細は `KeyDerivation::derive_key` を参照）
     ///   - Argon2パラメータエラー
     ///   - パスワードハッシュ生成エラー
     ///   - 無効なキー長エラー
     pub fn restore_master_key(&self, password: &str, salt: &[u8]) -> Result<MasterKey> {
-        self.derivation.derive_key(password, salt)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
