--- src/core/backup.rs
+++ replace * with / in BackupRunner::run
@@ -341,17 +341,17 @@
                             if f.should_exclude(&target.path) {
                                 continue;
                             }
                         }
 
                         // ファイルサイズチェック（100GB超の警告）
                         if let Ok(metadata) = target.path.metadata() {
                             let file_size = metadata.len();
-                            const LARGE_FILE_THRESHOLD: u64 = 100 * 1024 * 1024 * 1024; // 100GB
+                            const LARGE_FILE_THRESHOLD: u64 = 100 * 1024 / /* ~ changed by cargo-mutants ~ */ 1024 * 1024; // 100GB
 
                             if file_size > LARGE_FILE_THRESHOLD {
                                 eprintln!(
                                     "⚠️  警告: 大容量ファイル検出 ({}GB): {:?}",
                                     file_size / (1024 * 1024 * 1024),
                                     target.path
                                 );
                                 eprintln!("    メモリ不足のリスクがあります。処理を続行しますが、システム監視を推奨します。");
