--- src/crypto/key_management.rs
+++ replace MasterKey::from_bytes -> Self with Default::default()
@@ -21,17 +21,17 @@
         let mut key = [0u8; 32];
         OsRng.fill_bytes(&mut key);
         Self { key }
     }
 
     /// バイト配列からマスターキーを作成
     #[must_use]
     pub fn from_bytes(bytes: [u8; 32]) -> Self {
-        Self { key: bytes }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// キーのバイト配列を取得
     #[must_use]
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.key
     }
 }
