--- src/crypto/key_management.rs
+++ replace KeyDerivation::derive_key -> Result<MasterKey> with Ok(Default::default())
@@ -75,47 +75,17 @@
     ///
     /// 以下の場合にエラーを返します:
     /// - Argon2パラメータが無効な場合 (`BackupError::EncryptionError`)
     /// - ソルトのBase64エンコードに失敗した場合 (`BackupError::EncryptionError`)
     /// - パスワードハッシュ生成に失敗した場合 (`BackupError::EncryptionError`)
     /// - ハッシュの生成に失敗した場合 (`BackupError::EncryptionError`)
     /// - 生成されたキーの長さが32バイトでない場合 (`BackupError::EncryptionError`)
     pub fn derive_key(&self, password: &str, salt: &[u8]) -> Result<MasterKey> {
-        let argon2 = Argon2::new(
-            argon2::Algorithm::Argon2id,
-            argon2::Version::V0x13,
-            argon2::Params::new(
-                self.config.memory_cost,
-                self.config.time_cost,
-                self.config.parallelism,
-                Some(32),
-            )
-            .map_err(|e| BackupError::EncryptionError(format!("Argon2パラメータエラー: {e}")))?,
-        );
-
-        let salt_string = SaltString::encode_b64(salt)
-            .map_err(|e| BackupError::EncryptionError(format!("Salt エンコードエラー: {e}")))?;
-
-        let password_hash = argon2
-            .hash_password(password.as_bytes(), &salt_string)
-            .map_err(|e| BackupError::EncryptionError(format!("パスワードハッシュエラー: {e}")))?;
-
-        let hash = password_hash
-            .hash
-            .ok_or_else(|| BackupError::EncryptionError("ハッシュ生成に失敗".to_string()))?;
-        let hash_bytes = hash.as_bytes();
-
-        if hash_bytes.len() != 32 {
-            return Err(BackupError::EncryptionError("無効なキー長".to_string()));
-        }
-
-        let mut key = [0u8; 32];
-        key.copy_from_slice(hash_bytes);
-        Ok(MasterKey::from_bytes(key))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// ランダムなソルトを生成
     #[must_use]
     pub fn generate_salt() -> [u8; 16] {
         let mut salt = [0u8; 16];
         OsRng.fill_bytes(&mut salt);
         salt
