--- src/core/backup.rs
+++ replace > with >= in BackupRunner::run
@@ -343,17 +343,17 @@
                             }
                         }
 
                         // ファイルサイズチェック（100GB超の警告）
                         if let Ok(metadata) = target.path.metadata() {
                             let file_size = metadata.len();
                             const LARGE_FILE_THRESHOLD: u64 = 100 * 1024 * 1024 * 1024; // 100GB
 
-                            if file_size > LARGE_FILE_THRESHOLD {
+                            if file_size >= /* ~ changed by cargo-mutants ~ */ LARGE_FILE_THRESHOLD {
                                 eprintln!(
                                     "⚠️  警告: 大容量ファイル検出 ({}GB): {:?}",
                                     file_size / (1024 * 1024 * 1024),
                                     target.path
                                 );
                                 eprintln!("    メモリ不足のリスクがあります。処理を続行しますが、システム監視を推奨します。");
                             }
                         }
