--- src/core/backup.rs
+++ replace * with + in BackupRunner::run
@@ -374,17 +374,17 @@
                         .filter_map(std::result::Result::ok)
                     {
                         if entry.file_type().is_file() {
                             let source = entry.path().to_path_buf();
 
                             // ファイルサイズチェック（100GB超の警告）
                             if let Ok(metadata) = entry.metadata() {
                                 let file_size = metadata.len();
-                                const LARGE_FILE_THRESHOLD: u64 = 100 * 1024 * 1024 * 1024; // 100GB
+                                const LARGE_FILE_THRESHOLD: u64 = 100 * 1024 + /* ~ changed by cargo-mutants ~ */ 1024 * 1024; // 100GB
 
                                 if file_size > LARGE_FILE_THRESHOLD {
                                     eprintln!(
                                         "⚠️  警告: 大容量ファイル検出 ({}GB): {:?}",
                                         file_size / (1024 * 1024 * 1024),
                                         source
                                     );
                                     eprintln!("    メモリ不足のリスクがあります。処理を続行しますが、システム監視を推奨します。");
