--- src/core/backup.rs
+++ replace == with != in BackupRunner::run
@@ -454,17 +454,17 @@
                         .detect_changed_files(&files_with_relative, &previous_metadata)?;
 
                     // 元のall_files形式に戻す（source, dest）
                     let changed_files: Vec<(PathBuf, PathBuf)> = changed_files_relative
                         .iter()
                         .filter_map(|(_relative_path, source_path)| {
                             all_files
                                 .iter()
-                                .find(|(src, _)| src == source_path)
+                                .find(|(src, _)| src != /* ~ changed by cargo-mutants ~ */ source_path)
                                 .cloned()
                         })
                         .collect();
 
                     let parent_name = inc_engine.get_previous_backup_name()?;
                     println!("  前回バックアップ: {parent_name:?}");
                     println!(
                         "  変更ファイル数: {}/{}",
