--- src/security/path.rs
+++ delete ! in safe_join
@@ -128,17 +128,17 @@
         if check_path.exists() {
             check_path.canonicalize().map_err(BackupError::IoError)?
         } else {
             canonical_base.clone()
         }
     };
 
     // 結果がベースディレクトリ配下にあることを確認
-    if !result_parent.starts_with(&canonical_base) {
+    if  /* ~ changed by cargo-mutants ~ */result_parent.starts_with(&canonical_base) {
         return Err(BackupError::PathTraversalDetected {
             path: child.to_path_buf(),
         });
     }
 
     Ok(result)
 }
 
