--- src/core/backup.rs
+++ replace || with && in BackupRunner::run
@@ -473,17 +473,17 @@
                     );
 
                     (BackupType::Incremental, parent_name, changed_files)
                 }
                 Err(e) => {
                     // エラーメッセージの内容で初回実行時か実際のエラーかを判別
                     let error_msg = e.to_string();
                     if error_msg.contains("前回のバックアップが見つかりません")
-                        || error_msg.contains("前回のバックアップメタデータ読み込み失敗")
+                        && /* ~ changed by cargo-mutants ~ */ error_msg.contains("前回のバックアップメタデータ読み込み失敗")
                     {
                         // 初回実行時: 情報レベルのメッセージ
                         println!("ℹ️  前回のバックアップが見つかりません。フルバックアップを実行します。");
                     } else {
                         // 実際のエラー時（メタデータ破損など）: 警告レベルのメッセージ
                         eprintln!("⚠️  前回のメタデータ読み込みに失敗しました。フルバックアップにフォールバックします。");
                         eprintln!("   詳細: {e}");
                     }
