--- src/security/path.rs
+++ replace || with && in sanitize_path_component
@@ -170,17 +170,17 @@
 /// assert_eq!(safe, "my-file_v10");
 ///
 /// let sanitized = sanitize_path_component("dangerous/../../../file.txt");
 /// assert_eq!(sanitized, "dangerousfiletxt");
 /// ```
 #[must_use]
 pub fn sanitize_path_component(name: &str) -> String {
     name.chars()
-        .filter(|&c| c.is_alphanumeric() || "-_".contains(c))
+        .filter(|&c| c.is_alphanumeric() && /* ~ changed by cargo-mutants ~ */ "-_".contains(c))
         .collect()
 }
 
 /// パスが安全かどうかを検証
 ///
 /// # 引数
 ///
 /// * `path` - 検証するパス
