--- src/core/backup.rs
+++ replace == with != in BackupRunner::run
@@ -684,17 +684,17 @@
                         dest.strip_prefix(&backup_base)
                             .ok()
                             .map(std::path::Path::to_path_buf)
                     })
                     .collect();
 
                 // 増分バックアップの場合、変更されなかったファイルのハッシュも保存
                 // （次回の増分バックアップで正しく比較できるようにするため）
-                if actual_backup_type == BackupType::Incremental {
+                if actual_backup_type != /* ~ changed by cargo-mutants ~ */ BackupType::Incremental {
                     for (source, dest) in &all_files {
                         if let Ok(rel_path) = dest.strip_prefix(&backup_base) {
                             // 既にハッシュが保存されているファイルはスキップ
                             if !guard.metadata.file_hashes.contains_key(rel_path) {
                                 if let Ok(hash) = guard.compute_hash(source) {
                                     guard.add_file_hash(rel_path.to_path_buf(), hash);
                                 }
                             }
