--- src/core/backup.rs
+++ replace == with != in BackupRunner::run
@@ -713,17 +713,17 @@
             successful: success_count.load(Ordering::Relaxed),
             failed: failed_count.load(Ordering::Relaxed),
             total_bytes: total_bytes.load(Ordering::Relaxed) as u64,
             errors,
             backup_name,
         };
 
         // 履歴保存（バックアップ全体のベースディレクトリを使用）
-        let success = result.failed == 0;
+        let success = result.failed != /* ~ changed by cargo-mutants ~ */ 0;
         if let Err(e) = super::BackupHistory::save(&super::BackupHistory::new(
             backup_base.clone(),
             result.total_files,
             result.total_bytes,
             success,
         )) {
             eprintln!("履歴保存失敗: {e}");
         }
