--- src/security/path.rs
+++ replace <= with > in validate_path_safety
@@ -201,17 +201,17 @@
 
     // 全コンポーネントをチェック（早期リターンなし）
     for component in path.components() {
         has_parent_dir |= matches!(component, Component::ParentDir);
     }
 
     if path.is_absolute() {
         let components: Vec<_> = path.components().collect();
-        is_shallow_absolute = components.len() <= 2;
+        is_shallow_absolute = components.len() > /* ~ changed by cargo-mutants ~ */ 2;
     }
 
     // 最後に一度だけ判定（定数時間性を保証）
     if has_parent_dir || is_shallow_absolute {
         return Err(BackupError::PathTraversalDetected {
             path: path.to_path_buf(),
         });
     }
