--- src/core/integrity.rs
+++ replace BackupMetadata::load -> Result<Self> with Ok(Default::default())
@@ -134,29 +134,17 @@
     /// ```no_run
     /// use backup_suite::core::integrity::BackupMetadata;
     /// use std::path::PathBuf;
     ///
     /// let backup_dir = PathBuf::from("/backup/backup_20250107_120000");
     /// let metadata = BackupMetadata::load(&backup_dir).unwrap();
     /// ```
     pub fn load(backup_dir: &Path) -> Result<Self> {
-        let metadata_path = backup_dir.join(".integrity");
-        if !metadata_path.exists() {
-            return Err(anyhow::anyhow!(
-                "整合性メタデータが見つかりません: metadata_path.display()".to_string()
-            ));
-        }
-
-        let content = fs::read_to_string(&metadata_path)
-            .context("メタデータ読み込み失敗: metadata_path.display()".to_string())?;
-        let metadata: BackupMetadata =
-            serde_json::from_str(&content).context("メタデータJSON解析失敗")?;
-
-        Ok(metadata)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// バックアップディレクトリにメタデータを保存
     ///
     /// `.integrity` ファイルに JSON 形式でメタデータを保存します。
     ///
     /// # 引数
     ///
