--- src/security/path.rs
+++ replace safe_open -> Result<File> with Ok(Default::default())
@@ -254,57 +254,17 @@
 /// ```rust,no_run
 /// use backup_suite::security::safe_open;
 /// use std::path::Path;
 ///
 /// let path = Path::new("/home/user/backups/data.txt");
 /// let file = safe_open(path).unwrap();
 /// ```
 pub fn safe_open(path: &Path) -> Result<File> {
-    #[cfg(unix)]
-    {
-        use std::os::unix::fs::OpenOptionsExt;
-        OpenOptions::new()
-            .read(true)
-            .custom_flags(libc::O_NOFOLLOW)
-            .open(path)
-            .map_err(BackupError::IoError)
-    }
-
-    #[cfg(windows)]
-    {
-        use std::os::windows::fs::OpenOptionsExt;
-        const FILE_FLAG_OPEN_REPARSE_POINT: u32 = 0x00200000;
-        const FILE_ATTRIBUTE_REPARSE_POINT: u32 = 0x400;
-
-        // FILE_FLAG_OPEN_REPARSE_POINTでシンボリックリンク検出
-        let file = OpenOptions::new()
-            .read(true)
-            .custom_flags(FILE_FLAG_OPEN_REPARSE_POINT)
-            .open(path)
-            .map_err(BackupError::IoError)?;
-
-        // ファイルがリパースポイント（シンボリックリンク等）か確認
-        let metadata = file.metadata().map_err(BackupError::IoError)?;
-
-        use std::os::windows::fs::MetadataExt;
-        if metadata.file_attributes() & FILE_ATTRIBUTE_REPARSE_POINT != 0 {
-            return Err(BackupError::IoError(std::io::Error::new(
-                std::io::ErrorKind::Other,
-                "シンボリックリンクは許可されていません",
-            )));
-        }
-
-        Ok(file)
-    }
-
-    #[cfg(not(any(unix, windows)))]
-    {
-        File::open(path).map_err(BackupError::IoError)
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     use tempfile::TempDir;
 
