--- src/security/path.rs
+++ replace & with | in safe_open
@@ -281,17 +281,17 @@
             .custom_flags(FILE_FLAG_OPEN_REPARSE_POINT)
             .open(path)
             .map_err(BackupError::IoError)?;
 
         // ファイルがリパースポイント（シンボリックリンク等）か確認
         let metadata = file.metadata().map_err(BackupError::IoError)?;
 
         use std::os::windows::fs::MetadataExt;
-        if metadata.file_attributes() & FILE_ATTRIBUTE_REPARSE_POINT != 0 {
+        if metadata.file_attributes() | /* ~ changed by cargo-mutants ~ */ FILE_ATTRIBUTE_REPARSE_POINT != 0 {
             return Err(BackupError::IoError(std::io::Error::new(
                 std::io::ErrorKind::Other,
                 "シンボリックリンクは許可されていません",
             )));
         }
 
         Ok(file)
     }
