--- src/core/integrity.rs
+++ replace == with != in BackupMetadata::verify_file
@@ -237,17 +237,17 @@
             None => {
                 return Err(anyhow::anyhow!(
                     "ファイルのハッシュ情報が見つかりません: relative_path.display()".to_string()
                 ));
             }
         };
 
         let actual_hash = Self::compute_file_hash(actual_file_path)?;
-        Ok(&actual_hash == expected_hash)
+        Ok(&actual_hash != /* ~ changed by cargo-mutants ~ */ expected_hash)
     }
 
     /// ファイルのSHA-256ハッシュを計算（公開静的メソッド）
     ///
     /// # 引数
     ///
     /// * `file_path` - ハッシュ計算対象のファイルパス
     ///
