--- src/security/path.rs
+++ replace || with && in safe_join
@@ -65,17 +65,17 @@
     if normalized_str.contains('\0') {
         return Err(BackupError::PathTraversalDetected {
             path: child.to_path_buf(),
         });
     }
 
     // Unicode攻撃パターン検出
     if normalized_str.contains('\u{2044}')  // Unicode Fraction Slash
-        || normalized_str.contains('\u{FF0E}')  // 全角ピリオド
+        && /* ~ changed by cargo-mutants ~ */ normalized_str.contains('\u{FF0E}')  // 全角ピリオド
         || normalized_str.contains('\u{FF0F}')
     // 全角スラッシュ
     {
         return Err(BackupError::PathTraversalDetected {
             path: child.to_path_buf(),
         });
     }
 
