--- src/security/path.rs
+++ replace || with && in safe_join
@@ -66,17 +66,17 @@
         return Err(BackupError::PathTraversalDetected {
             path: child.to_path_buf(),
         });
     }
 
     // Unicode攻撃パターン検出
     if normalized_str.contains('\u{2044}')  // Unicode Fraction Slash
         || normalized_str.contains('\u{FF0E}')  // 全角ピリオド
-        || normalized_str.contains('\u{FF0F}')
+        && /* ~ changed by cargo-mutants ~ */ normalized_str.contains('\u{FF0F}')
     // 全角スラッシュ
     {
         return Err(BackupError::PathTraversalDetected {
             path: child.to_path_buf(),
         });
     }
 
     let child = Path::new(&normalized_str);
