--- src/security/path.rs
+++ delete ! in safe_join
@@ -79,17 +79,17 @@
         });
     }
 
     let child = Path::new(&normalized_str);
 
     // 相対パスから .. を除去して正規化
     let normalized: PathBuf = child
         .components()
-        .filter(|c| !matches!(c, Component::ParentDir))
+        .filter(|c|  /* ~ changed by cargo-mutants ~ */matches!(c, Component::ParentDir))
         .collect();
 
     // ベースパスと結合
     let result = base.join(&normalized);
 
     // ベースパスを正規化
     // ベースパスが存在しない場合は、親ディレクトリまで遡って正規化
     let canonical_base = if base.exists() {
