--- src/core/integrity.rs
+++ replace IntegrityChecker::add_file_hash with ()
@@ -374,17 +374,17 @@
     /// ```
     /// use backup_suite::core::integrity::IntegrityChecker;
     /// use std::path::PathBuf;
     ///
     /// let mut checker = IntegrityChecker::new();
     /// checker.add_file_hash(PathBuf::from("test.txt"), "abc123...".to_string());
     /// ```
     pub fn add_file_hash(&mut self, relative_path: PathBuf, hash: String) {
-        self.metadata.file_hashes.insert(relative_path, hash);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// メタデータをバックアップディレクトリに保存
     ///
     /// # 引数
     ///
     /// * `backup_dir` - バックアップディレクトリのパス
     ///
