--- src/crypto/encryption.rs
+++ replace EncryptedData::to_bytes -> Vec<u8> with vec![0]
@@ -39,23 +39,17 @@
     /// ファイル長（元のデータサイズ）
     pub original_size: u64,
 }
 
 impl EncryptedData {
     /// バイナリ形式にシリアライズ
     #[must_use]
     pub fn to_bytes(&self) -> Vec<u8> {
-        let mut result = Vec::with_capacity(44 + self.ciphertext.len());
-        result.extend_from_slice(&self.nonce); // 12バイト
-        result.extend_from_slice(&self.salt); // 16バイト
-        result.extend_from_slice(&self.original_size.to_le_bytes()); // 8バイト
-        result.extend_from_slice(&(self.ciphertext.len() as u64).to_le_bytes()); // 8バイト
-        result.extend_from_slice(&self.ciphertext); // 可変長
-        result
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 
     /// バイナリ形式からデシリアライズ
     pub fn from_bytes(data: &[u8]) -> Result<Self> {
         if data.len() < 44 {
             return Err(BackupError::EncryptionError(
                 "暗号化データが短すぎます".to_string(),
             ));
