--- src/core/integrity.rs
+++ replace IntegrityChecker::save_metadata -> Result<()> with Ok(())
@@ -403,17 +403,17 @@
     /// use backup_suite::core::integrity::IntegrityChecker;
     /// use std::path::PathBuf;
     ///
     /// let mut checker = IntegrityChecker::new();
     /// checker.add_file_hash(PathBuf::from("test.txt"), "abc123...".to_string());
     /// checker.save_metadata(&PathBuf::from("/backup/backup_20250107_120000")).unwrap();
     /// ```
     pub fn save_metadata(&self, backup_dir: &Path) -> Result<()> {
-        self.metadata.save(backup_dir)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 保存予定のファイル数を取得
     ///
     /// # 戻り値
     ///
     /// 登録されているファイルハッシュの数
     ///
