--- src/crypto/encryption.rs
+++ replace != with == in EncryptedData::from_bytes
@@ -80,17 +80,17 @@
             Some(len) => len,
             None => {
                 return Err(BackupError::EncryptionError(
                     "暗号化データの長さが不正です（オーバーフロー）".to_string(),
                 ));
             }
         };
 
-        if data.len() != expected_len {
+        if data.len() == /* ~ changed by cargo-mutants ~ */ expected_len {
             return Err(BackupError::EncryptionError(
                 "暗号化データの長さが一致しません".to_string(),
             ));
         }
 
         let ciphertext = data[44..].to_vec();
 
         Ok(Self {
