--- src/core/pipeline.rs
+++ replace PerformanceConfig::fast -> Self with Default::default()
@@ -97,22 +97,17 @@
         }
     }
 }
 
 impl PerformanceConfig {
     /// 高速設定
     #[must_use]
     pub fn fast() -> Self {
-        Self {
-            parallel_threads: num_cpus::get(), // 全コア使用
-            buffer_size: 2 * 1024 * 1024,      // 2MB
-            memory_limit: 1024 * 1024 * 1024,  // 1GB
-            batch_size: 64,                    // 大きめのバッチサイズ
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 品質重視設定
     #[must_use]
     pub fn quality() -> Self {
         Self {
             parallel_threads: (num_cpus::get() / 2).max(1), // コア数の半分
             buffer_size: 512 * 1024,                        // 512KB
