--- src/crypto/encryption.rs
+++ replace EncryptionEngine::generate_nonce -> [u8; 12] with [1; 12]
@@ -111,19 +111,17 @@
     /// 新しい暗号化エンジンを作成
     #[must_use]
     pub fn new(config: EncryptionConfig) -> Self {
         Self { config }
     }
 
     /// ランダムなナンスを生成（内部用）
     fn generate_nonce() -> [u8; 12] {
-        let mut nonce = [0u8; 12];
-        rand::rng().fill_bytes(&mut nonce);
-        nonce
+        [1; 12] /* ~ changed by cargo-mutants ~ */
     }
 
     /// ランダムなナンスを生成（公開API、pipeline.rsから使用）
     #[must_use]
     pub fn generate_nonce_internal() -> [u8; 12] {
         Self::generate_nonce()
     }
 
