--- src/crypto/encryption.rs
+++ replace EncryptionEngine::get_chunk_size -> usize with 0
@@ -125,17 +125,17 @@
     #[must_use]
     pub fn generate_nonce_internal() -> [u8; 12] {
         Self::generate_nonce()
     }
 
     /// チャンクサイズを取得（公開API、pipeline.rsから使用）
     #[must_use]
     pub fn get_chunk_size(&self) -> usize {
-        self.config.chunk_size
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// データを暗号化
     ///
     /// # Errors
     ///
     /// 以下の場合にエラーを返します:
     /// - AES-256-GCM暗号化処理が失敗した場合 (`BackupError::EncryptionError`)
