--- src/core/pipeline.rs
+++ replace PerformanceConfig::quality -> Self with Default::default()
@@ -108,22 +108,17 @@
             memory_limit: 1024 * 1024 * 1024,  // 1GB
             batch_size: 64,                    // 大きめのバッチサイズ
         }
     }
 
     /// 品質重視設定
     #[must_use]
     pub fn quality() -> Self {
-        Self {
-            parallel_threads: (num_cpus::get() / 2).max(1), // コア数の半分
-            buffer_size: 512 * 1024,                        // 512KB
-            memory_limit: 256 * 1024 * 1024,                // 256MB
-            batch_size: 16,                                 // 小さめのバッチサイズ
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// カスタム並列度設定
     #[must_use]
     pub fn with_parallelism(mut self, threads: usize) -> Self {
         self.parallel_threads = threads.max(1);
         self
     }
