--- src/core/pipeline.rs
+++ replace / with * in PerformanceConfig::quality
@@ -109,17 +109,17 @@
             batch_size: 64,                    // 大きめのバッチサイズ
         }
     }
 
     /// 品質重視設定
     #[must_use]
     pub fn quality() -> Self {
         Self {
-            parallel_threads: (num_cpus::get() / 2).max(1), // コア数の半分
+            parallel_threads: (num_cpus::get() * /* ~ changed by cargo-mutants ~ */ 2).max(1), // コア数の半分
             buffer_size: 512 * 1024,                        // 512KB
             memory_limit: 256 * 1024 * 1024,                // 256MB
             batch_size: 16,                                 // 小さめのバッチサイズ
         }
     }
 
     /// カスタム並列度設定
     #[must_use]
