--- src/core/pipeline.rs
+++ replace PerformanceConfig::with_parallelism -> Self with Default::default()
@@ -119,18 +119,17 @@
             memory_limit: 256 * 1024 * 1024,                // 256MB
             batch_size: 16,                                 // 小さめのバッチサイズ
         }
     }
 
     /// カスタム並列度設定
     #[must_use]
     pub fn with_parallelism(mut self, threads: usize) -> Self {
-        self.parallel_threads = threads.max(1);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// カスタムバッチサイズ設定
     #[must_use]
     pub fn with_batch_size(mut self, size: usize) -> Self {
         self.batch_size = size.max(1);
         self
     }
