--- src/core/pipeline.rs
+++ replace PerformanceConfig::with_batch_size -> Self with Default::default()
@@ -126,18 +126,17 @@
     pub fn with_parallelism(mut self, threads: usize) -> Self {
         self.parallel_threads = threads.max(1);
         self
     }
 
     /// カスタムバッチサイズ設定
     #[must_use]
     pub fn with_batch_size(mut self, size: usize) -> Self {
-        self.batch_size = size.max(1);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// 最適な並列度を計算
 ///
 /// CPU コア数の75%を使用し、システムリソースを確保する。
 /// 最小1スレッド、最大32スレッドに制限。
 #[must_use]
