--- src/crypto/encryption.rs
+++ replace += with *= in EncryptionEngine::decrypt_stream
@@ -302,17 +302,17 @@
 
             #[allow(deprecated)]
             let nonce = Nonce::from_slice(&chunk_nonce);
             let plaintext = cipher
                 .decrypt(nonce, chunk_data.as_ref())
                 .map_err(|e| BackupError::EncryptionError(format!("チャンク復号化エラー: {e}")))?;
 
             writer.write_all(&plaintext)?;
-            total_decrypted += plaintext.len() as u64;
+            total_decrypted *= /* ~ changed by cargo-mutants ~ */ plaintext.len() as u64;
             chunk_index += 1;
         }
 
         Ok(total_decrypted)
     }
 }
 
 impl Default for EncryptionEngine {
