--- src/crypto/encryption.rs
+++ replace += with *= in EncryptionEngine::decrypt_stream
@@ -303,17 +303,17 @@
             #[allow(deprecated)]
             let nonce = Nonce::from_slice(&chunk_nonce);
             let plaintext = cipher
                 .decrypt(nonce, chunk_data.as_ref())
                 .map_err(|e| BackupError::EncryptionError(format!("チャンク復号化エラー: {e}")))?;
 
             writer.write_all(&plaintext)?;
             total_decrypted += plaintext.len() as u64;
-            chunk_index += 1;
+            chunk_index *= /* ~ changed by cargo-mutants ~ */ 1;
         }
 
         Ok(total_decrypted)
     }
 }
 
 impl Default for EncryptionEngine {
     fn default() -> Self {
