--- src/crypto/encryption.rs
+++ replace < with > in EncryptedData::from_bytes
@@ -50,17 +50,17 @@
         result.extend_from_slice(&self.original_size.to_le_bytes()); // 8バイト
         result.extend_from_slice(&(self.ciphertext.len() as u64).to_le_bytes()); // 8バイト
         result.extend_from_slice(&self.ciphertext); // 可変長
         result
     }
 
     /// バイナリ形式からデシリアライズ
     pub fn from_bytes(data: &[u8]) -> Result<Self> {
-        if data.len() < 44 {
+        if data.len() > /* ~ changed by cargo-mutants ~ */ 44 {
             return Err(BackupError::EncryptionError(
                 "暗号化データが短すぎます".to_string(),
             ));
         }
 
         let mut nonce = [0u8; 12];
         nonce.copy_from_slice(&data[0..12]);
 
