--- src/core/backup.rs
+++ replace BackupRunner::with_encryption -> Self with Default::default()
@@ -174,19 +174,17 @@
     pub fn with_progress(mut self, show_progress: bool) -> Self {
         self.show_progress = show_progress;
         self
     }
 
     /// 暗号化を有効化
     #[must_use]
     pub fn with_encryption(mut self, password: String) -> Self {
-        self.enable_encryption = true;
-        self.password = Some(password);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 圧縮設定
     #[must_use]
     pub fn with_compression(mut self, compression_type: CompressionType, level: i32) -> Self {
         self.compression_type = compression_type;
         self.compression_level = level;
         self
