--- src/core/pipeline.rs
+++ replace dynamic_parallelism -> usize with 1
@@ -151,36 +151,17 @@
 /// ファイル数とファイルサイズに基づいて最適なスレッド数を計算する。
 ///
 /// # Arguments
 ///
 /// * `file_count` - 処理対象のファイル数
 /// * `avg_file_size` - 平均ファイルサイズ（バイト）
 #[must_use]
 pub fn dynamic_parallelism(file_count: usize, avg_file_size: u64) -> usize {
-    let base_parallelism = optimal_parallelism();
-
-    // ファイル数が少ない場合は並列度を抑える
-    if file_count < base_parallelism {
-        return file_count.max(1);
-    }
-
-    // 小さいファイルの場合はオーバーヘッドを考慮して並列度を抑える
-    if avg_file_size < 1024 * 1024 {
-        // 1MB未満
-        return (base_parallelism / 2).max(1);
-    }
-
-    // 大きいファイルの場合は並列度を増やす
-    if avg_file_size > 100 * 1024 * 1024 {
-        // 100MB超
-        return (base_parallelism * 4 / 3).min(32);
-    }
-
-    base_parallelism
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// 処理されたデータ
 #[derive(Debug, Clone)]
 pub struct ProcessedData {
     /// 元のファイルパス
     pub original_path: PathBuf,
     /// 処理後のデータ
