--- src/core/pipeline.rs
+++ replace < with > in dynamic_parallelism
@@ -154,17 +154,17 @@
 ///
 /// * `file_count` - 処理対象のファイル数
 /// * `avg_file_size` - 平均ファイルサイズ（バイト）
 #[must_use]
 pub fn dynamic_parallelism(file_count: usize, avg_file_size: u64) -> usize {
     let base_parallelism = optimal_parallelism();
 
     // ファイル数が少ない場合は並列度を抑える
-    if file_count < base_parallelism {
+    if file_count > /* ~ changed by cargo-mutants ~ */ base_parallelism {
         return file_count.max(1);
     }
 
     // 小さいファイルの場合はオーバーヘッドを考慮して並列度を抑える
     if avg_file_size < 1024 * 1024 {
         // 1MB未満
         return (base_parallelism / 2).max(1);
     }
