--- src/core/pipeline.rs
+++ replace PipelineConfig::with_encryption -> Self with Default::default()
@@ -36,18 +36,17 @@
         }
     }
 }
 
 impl PipelineConfig {
     /// 暗号化を有効にする
     #[must_use]
     pub fn with_encryption(mut self, config: EncryptionConfig) -> Self {
-        self.encryption = Some(config);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 圧縮を設定する
     #[must_use]
     pub fn with_compression(
         mut self,
         compression_type: CompressionType,
         config: CompressionConfig,
