--- src/core/pipeline.rs
+++ replace / with % in dynamic_parallelism
@@ -161,17 +161,17 @@
     // ファイル数が少ない場合は並列度を抑える
     if file_count < base_parallelism {
         return file_count.max(1);
     }
 
     // 小さいファイルの場合はオーバーヘッドを考慮して並列度を抑える
     if avg_file_size < 1024 * 1024 {
         // 1MB未満
-        return (base_parallelism / 2).max(1);
+        return (base_parallelism % /* ~ changed by cargo-mutants ~ */ 2).max(1);
     }
 
     // 大きいファイルの場合は並列度を増やす
     if avg_file_size > 100 * 1024 * 1024 {
         // 100MB超
         return (base_parallelism * 4 / 3).min(32);
     }
 
