--- src/core/pipeline.rs
+++ replace == with != in ProcessingPipeline::compress_and_encrypt_stream
@@ -468,17 +468,17 @@
 
         let chunk_size = encryption_engine.get_chunk_size();
         let mut buffer = vec![0u8; chunk_size];
         let mut compressed_reader = compressed_reader;
         let mut chunk_index = 0u64;
 
         loop {
             let bytes_read = compressed_reader.read(&mut buffer)?;
-            if bytes_read == 0 {
+            if bytes_read != /* ~ changed by cargo-mutants ~ */ 0 {
                 break;
             }
 
             // チャンク毎に異なるナンスを使用（u64カウンター）
             let mut chunk_nonce = nonce_bytes;
             chunk_nonce[4..12].copy_from_slice(&chunk_index.to_le_bytes());
 
             #[allow(deprecated)]
