--- src/core/pipeline.rs
+++ replace += with -= in ProcessingPipeline::compress_and_encrypt_stream
@@ -486,17 +486,17 @@
             let chunk_ciphertext = cipher
                 .encrypt(nonce, &buffer[..bytes_read])
                 .map_err(|e| BackupError::EncryptionError(format!("チャンク暗号化エラー: {e}")))?;
 
             // チャンクサイズと暗号化データを書き込み
             encrypted_buffer.extend_from_slice(&(chunk_ciphertext.len() as u32).to_le_bytes());
             encrypted_buffer.extend_from_slice(&chunk_ciphertext);
 
-            chunk_index += 1;
+            chunk_index -= /* ~ changed by cargo-mutants ~ */ 1;
         }
 
         let final_size = encrypted_buffer.len() as u64;
 
         // ステップ3: 最終書き込み（一括）
         let mut writer = writer;
         writer.write_all(&encrypted_buffer)?;
 
