--- src/core/pipeline.rs
+++ replace > with < in dynamic_parallelism
@@ -165,17 +165,17 @@
 
     // 小さいファイルの場合はオーバーヘッドを考慮して並列度を抑える
     if avg_file_size < 1024 * 1024 {
         // 1MB未満
         return (base_parallelism / 2).max(1);
     }
 
     // 大きいファイルの場合は並列度を増やす
-    if avg_file_size > 100 * 1024 * 1024 {
+    if avg_file_size < /* ~ changed by cargo-mutants ~ */ 100 * 1024 * 1024 {
         // 100MB超
         return (base_parallelism * 4 / 3).min(32);
     }
 
     base_parallelism
 }
 
 /// 処理されたデータ
