--- src/core/pipeline.rs
+++ replace * with / in dynamic_parallelism
@@ -167,17 +167,17 @@
     if avg_file_size < 1024 * 1024 {
         // 1MB未満
         return (base_parallelism / 2).max(1);
     }
 
     // 大きいファイルの場合は並列度を増やす
     if avg_file_size > 100 * 1024 * 1024 {
         // 100MB超
-        return (base_parallelism * 4 / 3).min(32);
+        return (base_parallelism / /* ~ changed by cargo-mutants ~ */ 4 / 3).min(32);
     }
 
     base_parallelism
 }
 
 /// 処理されたデータ
 #[derive(Debug, Clone)]
 pub struct ProcessedData {
