--- src/core/pipeline.rs
+++ replace ProcessingPipeline::process_file -> Result<ProcessedData> with Ok(Default::default())
@@ -276,69 +276,17 @@
 
     /// ファイルを処理（圧縮 → 暗号化）
     pub fn process_file<P: AsRef<Path>>(
         &self,
         file_path: P,
         master_key: Option<&MasterKey>,
         salt: Option<[u8; 16]>,
     ) -> Result<ProcessedData> {
-        let start_time = std::time::Instant::now();
-        let file_path = file_path.as_ref().to_path_buf();
-
-        // ファイル読み込み
-        let original_data = std::fs::read(&file_path)?;
-        let original_size = original_data.len() as u64;
-
-        // Step 1: 圧縮
-        let (compressed_data, compression_info) =
-            if self.config.compression_type != CompressionType::None {
-                let compressed = self.compression_engine.compress(&original_data)?;
-                let _compression_ratio = compressed.compression_percentage();
-                (compressed.data.clone(), Some(compressed))
-            } else {
-                (original_data, None)
-            };
-
-        let compressed_size = compressed_data.len() as u64;
-
-        // Step 2: 暗号化
-        let (final_data, encryption_info) = if let (Some(engine), Some(key), Some(s)) =
-            (&self.encryption_engine, master_key, salt)
-        {
-            let encrypted = engine.encrypt(&compressed_data, key, s)?;
-            (encrypted.to_bytes(), Some(encrypted))
-        } else {
-            (compressed_data, None)
-        };
-
-        let final_size = final_data.len() as u64;
-        let processing_time = start_time.elapsed().as_millis() as u64;
-
-        let metadata = ProcessingMetadata {
-            original_size,
-            compressed_size,
-            final_size,
-            processing_time_ms: processing_time,
-            compression_ratio: if original_size > 0 {
-                (original_size.saturating_sub(compressed_size) as f64 / original_size as f64)
-                    * 100.0
-            } else {
-                0.0
-            },
-            memory_usage: (original_size + compressed_size + final_size),
-        };
-
-        Ok(ProcessedData {
-            original_path: file_path,
-            data: final_data,
-            compression_info,
-            encryption_info,
-            metadata,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// データを復元（復号化 → 展開）
     pub fn restore_data(
         &self,
         processed_data: &ProcessedData,
         master_key: Option<&MasterKey>,
     ) -> Result<Vec<u8>> {
