--- src/core/pipeline.rs
+++ replace != with == in ProcessingPipeline::process_file
@@ -285,17 +285,17 @@
         let file_path = file_path.as_ref().to_path_buf();
 
         // ファイル読み込み
         let original_data = std::fs::read(&file_path)?;
         let original_size = original_data.len() as u64;
 
         // Step 1: 圧縮
         let (compressed_data, compression_info) =
-            if self.config.compression_type != CompressionType::None {
+            if self.config.compression_type == /* ~ changed by cargo-mutants ~ */ CompressionType::None {
                 let compressed = self.compression_engine.compress(&original_data)?;
                 let _compression_ratio = compressed.compression_percentage();
                 (compressed.data.clone(), Some(compressed))
             } else {
                 (original_data, None)
             };
 
         let compressed_size = compressed_data.len() as u64;
