--- src/core/pipeline.rs
+++ replace + with - in ProcessingPipeline::process_file
@@ -319,17 +319,17 @@
             final_size,
             processing_time_ms: processing_time,
             compression_ratio: if original_size > 0 {
                 (original_size.saturating_sub(compressed_size) as f64 / original_size as f64)
                     * 100.0
             } else {
                 0.0
             },
-            memory_usage: (original_size + compressed_size + final_size),
+            memory_usage: (original_size - /* ~ changed by cargo-mutants ~ */ compressed_size + final_size),
         };
 
         Ok(ProcessedData {
             original_path: file_path,
             data: final_data,
             compression_info,
             encryption_info,
             metadata,
