--- src/core/pipeline.rs
+++ replace ProcessingPipeline::restore_data -> Result<Vec<u8>> with Ok(vec![1])
@@ -337,35 +337,17 @@
     }
 
     /// データを復元（復号化 → 展開）
     pub fn restore_data(
         &self,
         processed_data: &ProcessedData,
         master_key: Option<&MasterKey>,
     ) -> Result<Vec<u8>> {
-        let mut data = processed_data.data.clone();
-
-        // Step 1: 復号化
-        if let Some(encryption_info) = &processed_data.encryption_info {
-            if let (Some(engine), Some(key)) = (&self.encryption_engine, master_key) {
-                data = engine.decrypt(encryption_info, key)?;
-            } else {
-                return Err(BackupError::EncryptionError(
-                    "復号化にはマスターキーが必要です".to_string(),
-                ));
-            }
-        }
-
-        // Step 2: 展開
-        if let Some(compression_info) = &processed_data.compression_info {
-            data = self.compression_engine.decompress(compression_info)?;
-        }
-
-        Ok(data)
+        Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// ストリーミング処理（大容量ファイル用）
     ///
     /// # 真のストリーミング処理実装
     ///
     /// - チャンク単位での圧縮・暗号化処理
     /// - メモリ使用量: O(chunk_size) = 最大2MB
