--- src/core/pipeline.rs
+++ replace ProcessingPipeline::process_stream -> Result<ProcessingMetadata> with Ok(Default::default())
@@ -387,48 +387,17 @@
     /// - 暗号化処理エラー (`BackupError::EncryptionError`)
     pub fn process_stream<R: Read, W: Write>(
         &self,
         reader: R,
         writer: W,
         master_key: Option<&MasterKey>,
         salt: Option<[u8; 16]>,
     ) -> Result<ProcessingMetadata> {
-        let start_time = std::time::Instant::now();
-
-        // 真のストリーミング処理
-        // 1. 圧縮 + 暗号化のパイプライン処理
-        let (original_size, compressed_size, final_size) =
-            if let (Some(engine), Some(key), Some(s)) = (&self.encryption_engine, master_key, salt)
-            {
-                // 圧縮 → 暗号化パイプライン（ストリーミング）
-                self.compress_and_encrypt_stream(reader, writer, engine, key, s)?
-            } else if self.config.compression_type != CompressionType::None {
-                // 圧縮のみ（ストリーミング）
-                self.compress_stream_only(reader, writer)?
-            } else {
-                // 圧縮も暗号化もなし（単純コピー、ストリーミング）
-                self.copy_stream(reader, writer)?
-            };
-
-        let processing_time = start_time.elapsed().as_millis() as u64;
-
-        Ok(ProcessingMetadata {
-            original_size,
-            compressed_size,
-            final_size,
-            processing_time_ms: processing_time,
-            compression_ratio: if original_size > 0 {
-                (original_size.saturating_sub(compressed_size) as f64 / original_size as f64)
-                    * 100.0
-            } else {
-                0.0
-            },
-            memory_usage: 2 * 1024 * 1024, // 2MB固定（チャンクサイズベース）
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 圧縮 + 暗号化ストリーミング処理（内部実装）
     ///
     /// # 返り値
     ///
     /// `(original_size, compressed_size, final_size)` のタプル
     fn compress_and_encrypt_stream<R: Read, W: Write>(
