--- src/core/pipeline.rs
+++ replace != with == in ProcessingPipeline::process_stream
@@ -396,17 +396,17 @@
 
         // 真のストリーミング処理
         // 1. 圧縮 + 暗号化のパイプライン処理
         let (original_size, compressed_size, final_size) =
             if let (Some(engine), Some(key), Some(s)) = (&self.encryption_engine, master_key, salt)
             {
                 // 圧縮 → 暗号化パイプライン（ストリーミング）
                 self.compress_and_encrypt_stream(reader, writer, engine, key, s)?
-            } else if self.config.compression_type != CompressionType::None {
+            } else if self.config.compression_type == /* ~ changed by cargo-mutants ~ */ CompressionType::None {
                 // 圧縮のみ（ストリーミング）
                 self.compress_stream_only(reader, writer)?
             } else {
                 // 圧縮も暗号化もなし（単純コピー、ストリーミング）
                 self.copy_stream(reader, writer)?
             };
 
         let processing_time = start_time.elapsed().as_millis() as u64;
