--- src/core/pipeline.rs
+++ replace ProcessingPipeline::compress_stream_only -> Result<(u64, u64, u64)> with Ok((0, 1, 1))
@@ -504,22 +504,17 @@
     }
 
     /// 圧縮のみストリーミング処理（内部実装）
     fn compress_stream_only<R: Read, W: Write>(
         &self,
         reader: R,
         writer: W,
     ) -> Result<(u64, u64, u64)> {
-        let compressed_data = self.compression_engine.compress_stream(reader, writer)?;
-
-        let original_size = compressed_data.original_size;
-        let compressed_size = compressed_data.compressed_size;
-
-        Ok((original_size, compressed_size, compressed_size))
+        Ok((0, 1, 1)) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 単純コピーストリーミング処理（内部実装）
     fn copy_stream<R: Read, W: Write>(
         &self,
         mut reader: R,
         mut writer: W,
     ) -> Result<(u64, u64, u64)> {
