--- src/core/pipeline.rs
+++ replace ProcessingPipeline::copy_stream -> Result<(u64, u64, u64)> with Ok((1, 1, 1))
@@ -518,30 +518,17 @@
     }
 
     /// 単純コピーストリーミング処理（内部実装）
     fn copy_stream<R: Read, W: Write>(
         &self,
         mut reader: R,
         mut writer: W,
     ) -> Result<(u64, u64, u64)> {
-        let mut total_size = 0u64;
-        let mut buffer = vec![0u8; 1024 * 1024]; // 1MB チャンク
-
-        loop {
-            let bytes_read = reader.read(&mut buffer)?;
-            if bytes_read == 0 {
-                break;
-            }
-
-            writer.write_all(&buffer[..bytes_read])?;
-            total_size += bytes_read as u64;
-        }
-
-        Ok((total_size, total_size, total_size))
+        Ok((1, 1, 1)) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 複数ファイルを並列処理
     ///
     /// # Arguments
     ///
     /// * `files` - 処理対象のファイルパスのスライス
     /// * `master_key` - マスターキー（暗号化時のみ必要）
