--- src/core/pipeline.rs
+++ replace == with != in ProcessingPipeline::copy_stream
@@ -523,17 +523,17 @@
         mut reader: R,
         mut writer: W,
     ) -> Result<(u64, u64, u64)> {
         let mut total_size = 0u64;
         let mut buffer = vec![0u8; 1024 * 1024]; // 1MB チャンク
 
         loop {
             let bytes_read = reader.read(&mut buffer)?;
-            if bytes_read == 0 {
+            if bytes_read != /* ~ changed by cargo-mutants ~ */ 0 {
                 break;
             }
 
             writer.write_all(&buffer[..bytes_read])?;
             total_size += bytes_read as u64;
         }
 
         Ok((total_size, total_size, total_size))
