--- src/core/pipeline.rs
+++ replace ProcessingPipeline::process_files_parallel -> Vec<Result<ProcessedData>> with vec![Ok(Default::default())]
@@ -551,26 +551,17 @@
     ///
     /// 各ファイルの処理結果を含むベクター
     pub fn process_files_parallel<P: AsRef<Path> + Send + Sync>(
         &self,
         files: &[P],
         master_key: Option<&MasterKey>,
         salt: Option<[u8; 16]>,
     ) -> Vec<Result<ProcessedData>> {
-        if files.is_empty() {
-            return Vec::new();
-        }
-
-        // ThreadPoolが利用可能な場合はそれを使用、なければグローバルプールを使用
-        if let Some(pool) = &self.thread_pool {
-            pool.install(|| self.process_files_parallel_internal(files, master_key, salt))
-        } else {
-            self.process_files_parallel_internal(files, master_key, salt)
-        }
+        vec![Ok(Default::default())] /* ~ changed by cargo-mutants ~ */
     }
 
     /// 内部並列処理実装
     fn process_files_parallel_internal<P: AsRef<Path> + Send + Sync>(
         &self,
         files: &[P],
         master_key: Option<&MasterKey>,
         salt: Option<[u8; 16]>,
