--- src/core/pipeline.rs
+++ replace PipelineConfig::with_compression -> Self with Default::default()
@@ -47,19 +47,17 @@
 
     /// 圧縮を設定する
     #[must_use]
     pub fn with_compression(
         mut self,
         compression_type: CompressionType,
         config: CompressionConfig,
     ) -> Self {
-        self.compression_type = compression_type;
-        self.compression = config;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 高速設定に変更
     #[must_use]
     pub fn fast(mut self) -> Self {
         self.compression = CompressionConfig::fast(self.compression_type);
         self.performance = PerformanceConfig::fast();
         self
