--- src/core/pipeline.rs
+++ replace ProcessingPipeline::config -> &PipelineConfig with Box::leak(Box::new(Default::default()))
@@ -624,17 +624,17 @@
                 result
             })
             .collect()
     }
 
     /// 設定を取得
     #[must_use]
     pub fn config(&self) -> &PipelineConfig {
-        &self.config
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// パフォーマンス統計を取得
     #[must_use]
     pub fn get_performance_stats(&self) -> PerformanceStats {
         PerformanceStats {
             available_threads: self.config.performance.parallel_threads,
             buffer_size: self.config.performance.buffer_size,
