--- src/core/pipeline.rs
+++ replace ProcessingPipeline::get_performance_stats -> PerformanceStats with Default::default()
@@ -630,23 +630,17 @@
     #[must_use]
     pub fn config(&self) -> &PipelineConfig {
         &self.config
     }
 
     /// パフォーマンス統計を取得
     #[must_use]
     pub fn get_performance_stats(&self) -> PerformanceStats {
-        PerformanceStats {
-            available_threads: self.config.performance.parallel_threads,
-            buffer_size: self.config.performance.buffer_size,
-            memory_limit: self.config.performance.memory_limit,
-            encryption_enabled: self.encryption_engine.is_some(),
-            compression_type: self.config.compression_type,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// ThreadPoolが正常に作成されているか確認
     #[must_use]
     pub fn is_parallel_ready(&self) -> bool {
         self.thread_pool.is_some()
     }
 
