--- src/core/pipeline.rs
+++ replace PipelineConfig::fast -> Self with Default::default()
@@ -55,19 +55,17 @@
         self.compression_type = compression_type;
         self.compression = config;
         self
     }
 
     /// 高速設定に変更
     #[must_use]
     pub fn fast(mut self) -> Self {
-        self.compression = CompressionConfig::fast(self.compression_type);
-        self.performance = PerformanceConfig::fast();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// 高圧縮率設定に変更
     #[must_use]
     pub fn best_compression(mut self) -> Self {
         self.compression = CompressionConfig::best(self.compression_type);
         self.performance = PerformanceConfig::quality();
         self
