--- src/core/pipeline.rs
+++ replace PipelineConfig::best_compression -> Self with Default::default()
@@ -63,19 +63,17 @@
         self.compression = CompressionConfig::fast(self.compression_type);
         self.performance = PerformanceConfig::fast();
         self
     }
 
     /// 高圧縮率設定に変更
     #[must_use]
     pub fn best_compression(mut self) -> Self {
-        self.compression = CompressionConfig::best(self.compression_type);
-        self.performance = PerformanceConfig::quality();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// パフォーマンス設定
 #[derive(Debug, Clone)]
 pub struct PerformanceConfig {
     /// 並列処理数
     pub parallel_threads: usize,
