--- src/core/restore.rs
+++ replace > with >= in RestoreEngine::restore
@@ -110,17 +110,17 @@
             return Err(anyhow::anyhow!(
                 "バックアップディレクトリが存在しません: backup_dir.display()".to_string()
             ));
         }
 
         // 増分バックアップチェーンの解決
         let backup_chain = resolve_backup_chain(backup_dir)?;
 
-        if backup_chain.len() > 1 {
+        if backup_chain.len() >= /* ~ changed by cargo-mutants ~ */ 1 {
             println!(
                 "📦 増分バックアップチェーン検出: {} 個のバックアップを順次復元",
                 backup_chain.len()
             );
             for (i, backup) in backup_chain.iter().enumerate() {
                 println!("  {}. {:?}", i + 1, backup.file_name().unwrap_or_default());
             }
         }
