--- src/core/restore.rs
+++ replace != with == in RestoreEngine::restore
@@ -135,17 +135,17 @@
         let mut all_files: Vec<(PathBuf, PathBuf)> = Vec::new(); // (source_backup_dir, file_path)
         for backup in &backup_chain {
             let files_in_backup: Vec<PathBuf> = WalkDir::new(backup)
                 .into_iter()
                 .filter_map(std::result::Result::ok)
                 .filter(|e| e.file_type().is_file())
                 .filter(|e| {
                     // .integrityファイルを除外
-                    e.file_name() != ".integrity"
+                    e.file_name() == /* ~ changed by cargo-mutants ~ */ ".integrity"
                 })
                 .map(|e| e.path().to_path_buf())
                 .collect();
 
             for file_path in files_in_backup {
                 all_files.push((backup.clone(), file_path));
             }
         }
