--- src/core/restore.rs
+++ replace == with != in RestoreEngine::restore
@@ -420,17 +420,17 @@
                 "restored": result.restored,
                 "failed": result.failed,
                 "encrypted_files": result.encrypted_files,
                 "verified_files": result.verified_files,
                 "verification_failures": result.verification_failures,
                 "total_bytes": result.total_bytes,
             });
 
-            let event = if result.failed == 0 {
+            let event = if result.failed != /* ~ changed by cargo-mutants ~ */ 0 {
                 AuditEvent::restore_completed(&target_desc, &user, metadata)
             } else {
                 AuditEvent::restore_failed(
                     &target_desc,
                     &user,
                     format!("{}件のファイルでエラーが発生しました", result.failed),
                 )
             };
