--- src/core/restore.rs
+++ replace RestoreEngine::decompress_if_needed -> Result<Vec<u8>> with Ok(vec![1])
@@ -441,28 +441,17 @@
         }
 
         Ok(result)
     }
 
     /// 圧縮されている場合に展開
     fn decompress_if_needed(&self, data: &[u8]) -> Result<Vec<u8>> {
         // zstd → gzip → 無圧縮の順で試す
-        if let Ok(decompressed) = zstd::decode_all(data) {
-            Ok(decompressed)
-        } else {
-            let mut decoder = flate2::read::GzDecoder::new(data);
-            let mut decompressed = Vec::new();
-            if decoder.read_to_end(&mut decompressed).is_ok() && !decompressed.is_empty() {
-                Ok(decompressed)
-            } else {
-                // 圧縮されていないと判断
-                Ok(data.to_vec())
-            }
-        }
+        Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::fs;
     use tempfile::TempDir;
