--- src/core/restore.rs
+++ replace && with || in RestoreEngine::decompress_if_needed
@@ -446,17 +446,17 @@
     /// 圧縮されている場合に展開
     fn decompress_if_needed(&self, data: &[u8]) -> Result<Vec<u8>> {
         // zstd → gzip → 無圧縮の順で試す
         if let Ok(decompressed) = zstd::decode_all(data) {
             Ok(decompressed)
         } else {
             let mut decoder = flate2::read::GzDecoder::new(data);
             let mut decompressed = Vec::new();
-            if decoder.read_to_end(&mut decompressed).is_ok() && !decompressed.is_empty() {
+            if decoder.read_to_end(&mut decompressed).is_ok() || /* ~ changed by cargo-mutants ~ */ !decompressed.is_empty() {
                 Ok(decompressed)
             } else {
                 // 圧縮されていないと判断
                 Ok(data.to_vec())
             }
         }
     }
 }
