--- src/core/restore.rs
+++ delete ! in RestoreEngine::restore
@@ -90,17 +90,17 @@
 
         // 監査ログ: 復元開始
         if let Some(ref mut audit_log) = self.audit_log {
             let _ = audit_log
                 .log(AuditEvent::restore_started(&target_desc, &user))
                 .map_err(|e| eprintln!("警告: 監査ログの記録に失敗しました: {e}"));
         }
 
-        if !backup_dir.exists() {
+        if  /* ~ changed by cargo-mutants ~ */backup_dir.exists() {
             // 監査ログ: 復元失敗
             if let Some(ref mut audit_log) = self.audit_log {
                 let _ = audit_log
                     .log(AuditEvent::restore_failed(
                         &target_desc,
                         &user,
                         "バックアップディレクトリが存在しません",
                     ))
